# تنظیمات پایه
CHANNEL_USERNAME = "@arzinoexchannel"

# انواع حواله‌ها
TRANSFER_TYPES = {
    "transfer": "حواله بانکی",
    "paypal": "پی پال",
    "cash": "اسکناس"
}

# الگوی regex برای استخراج اطلاعات از پیام‌ها
TRANSFER_REGEX = r"""
    (?P<country>[\w\s]+)\s+
    (?P<amount>[\d,]+)\s+
    مبلغ\s+(?P<value>[\d,]+)\s+
    نرخ\s*:(?P<price>\d+)\s+
    حواله
"""


EXCHANGE_CONDITIONS = """
    ✅ <b>شرایط تبادل ارز</b> ✅

    💱 <b>نرخ تبادل:</b>
    - نرخ به‌صورت توافقی بین طرفین تعیین شده
    - پس از توافق، نرخ ثابت خواهد بود
    - با نوسانات بازار تغییر نخواهد کرد

    🔐 <b>احراز هویت و حساب‌ها:</b>
    - تنها تراکنش‌های حساب شخص خریدار یا حساب‌های تأییدشده پذیرفته می‌شود
    - در غیر این‌صورت، احراز هویت الزامی است

    💵 <b>واریز تومانی توسط خریدار:</b>
    - پرداخت به حساب‌های اعلامی از سوی ما
    - باید طی چند ساعت کاری انجام شود
    - در صورت تأخیر، هماهنگی قبلی ضروری است

    📨 <b>تأیید فیش‌های واریزی:</b>
    - ارسال رسیدهای واریز تومان و یورو الزامی است
    - تا زمان رسیدن مبلغ به حساب مقصد، پرداختی انجام نمی‌شود

    ⏳ <b>تسویه تومانی توسط ما:</b>
    - تسویه در مدت یک روز کاری
    - ممکن است در چند پارت انجام شود
    - اطلاعات ناقص باعث تأخیر در پرداخت می‌شود

    🏦 <b>تأیید واریزی‌های تومانی:</b>
    - پرداخت از طریق شماره کارت یا شبا
    - زمان واریز طبق سیکل بانکی مرکزی
    - عدم پاسخ بیش از ۴ ساعت = تأیید خودکار

    🌍 <b>اتباع خارجی:</b>
    - برای صاحبان حساب غیرایرانی اطلاع‌رسانی الزامی است
    - عدم اعلام = عدم مسئولیت ما

    💶 <b>واریزی‌های یورویی:</b>
    - مسئولیت تأیید با خریدار است
    - ما فقط تسهیل‌گر هستیم
    - عدم پاسخ‌گویی در مهلت مقرر = تأیید خودکار
      (۶ ساعت برای واریزهای آنی - ۲ روز کاری برای عادی)

    ⚖️ <b>مسئولیت تبادل:</b>
    - مسئولیت اصلی با طرفین معامله
    - ما تضمین‌کننده اصل مبلغ هستیم
    - در صورت مشکل، حمایت کامل برای حل آن

    ⏱️ <b>زمان واریز یورویی:</b>
    - فروشنده باید طی چند ساعت کاری واریز کند
    - مگر با هماهنگی قبلی
    - تعداد پارت‌های پرداخت نیاز به هماهنگی دارد

    ⚠️ <b>ملاحظات رفرنس بانکی:</b>
    - عدم استفاده از کلمات ممنوعه در توضیحات:
      Exchange, Iran, Tooman, Rial, اسامی ایرانی
    - مسئولیت کامل با فرستنده است

    💰 <b>کارمزد تبادل:</b>
    - کارمزد نیم درصد (حداقل ۲.۵ یورو)
    - برای مبالغ زیر ۵۰۰ یورو: کارمزد ثابت ۲.۵ یورو
    - محاسبه روی مبلغ تومانی

    🕒 <b>تاخیر در رسیدن یورو:</b>
    - در صورت عدم دریافت در مهلت قانونی
    - فرایند پیگیری و بررسی آغاز می‌شود
    - همکاری طرفین الزامی است

    📝 <b>نیاز به اطلاعات تکمیلی بانکی:</b>
    - در برخی موارد بانک نیاز به اطلاعات بیشتر دارد
    - باید با هماهنگی ما و تأیید طرفین ارائه شود

    🔒 <b>امنیت ارتباط:</b>
    - ممنوعیت ارائه شماره تماس مستقیم
    - ممنوعیت ارتباط خارج از سیستم
    - مکاتبات فقط از طریق ربات/سایت
    """
CHANNEL_USERNAME = "arzinoexchannel" 
ADMIN_USERNAME = "Arzinoex_admin"